examples/openfoam2206/singleBuilding/kOmegaSST_F1blend/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Domain dimensions (m)
xMin   -1;
xMax   3;
yMin   -0.75;
yMax   0.75;
zMin   0;
zMax   1.5;

// Building dimensions (m)
H      0.125;  //height
B      0.15;   //width
D      0.1;   //depth

// Number of grid divisions on buidling

nCell1   5;   // 0.5* streamwise (x) divisions (/2) on side faces of building
nCell2   5;  // 0.5 * lateral (y) divisions on front and back faces of buidling
nCell3   4;   // 0.5* veritcal (z) divisions (/2) along building height

// Number of grid divisions of domain

nCell4   10;  // x divisions upstream of building
nCell5   15;  // x divisions downstream of building
nCell6   10;  // lateral (y) divisions of domain either side of building
nCell7   10;  // veritcal (z) divisions from buidling roof to top boundary of domain


Hdiv2 #calc "0.5*$H";
Bdiv2 #calc "0.5*$B";
negBdiv2 #calc "-0.5*$B";
Ddiv2 #calc "0.5*$D";
negDdiv2 #calc "-0.5*$D";


vertices
(

  (	$xMin	  $yMax	$zMin	)
  ( 	$negDdiv2	  $yMax	$zMin	)
  ( 	0	  $yMax	$zMin	)
  ( 	$Ddiv2	  $yMax	$zMin	)
  (	$xMax	  $yMax	$zMin	)
  (	$xMin	  $yMax	$Hdiv2	)
  ( 	$negDdiv2	  $yMax $Hdiv2 )
  ( 	0	  $yMax $Hdiv2 )
  ( 	$Ddiv2	  $yMax $Hdiv2 )
  (	$xMax	  $yMax $Hdiv2 )
  (	$xMin	  $yMax	$H	)
  ( 	$negDdiv2	  $yMax	$H	)
  ( 	0	  $yMax	$H	)
  ( 	$Ddiv2	  $yMax	$H	)
  (	$xMax	  $yMax	$H	)
  (	$xMin	  $yMax	$zMax	)
  ( 	$negDdiv2	  $yMax	$zMax	)
  ( 	0	  $yMax	$zMax	)
  ( 	$Ddiv2	  $yMax	$zMax	)
  (	$xMax	  $yMax	$zMax	)
  (	$xMin	$Bdiv2	$zMin	)
  ( 	$negDdiv2	$Bdiv2	$zMin	)
  ( 	0	$Bdiv2	$zMin	)
  ( 	$Ddiv2	$Bdiv2	$zMin	)
  (	$xMax	$Bdiv2	$zMin	)
  (	$xMin	$Bdiv2 $Hdiv2 )
  ( 	$negDdiv2	$Bdiv2 $Hdiv2 )
  ( 	0	$Bdiv2 $Hdiv2 )
  ( 	$Ddiv2	$Bdiv2 $Hdiv2 )
  (	$xMax	$Bdiv2 $Hdiv2 )
  (	$xMin	$Bdiv2	$H	)
  ( 	$negDdiv2	$Bdiv2	$H	)
  ( 	0	$Bdiv2	$H	)
  ( 	$Ddiv2	$Bdiv2	$H	)
  (	$xMax	$Bdiv2	$H	)
  (	$xMin	$Bdiv2	$zMax	)
  ( 	$negDdiv2	$Bdiv2	$zMax	)
  ( 	0	$Bdiv2	$zMax	)
  ( 	$Ddiv2	$Bdiv2	$zMax	)
  (	$xMax	$Bdiv2	$zMax	)
  (	$xMin	0	$zMin	)
  ( 	$negDdiv2	0	$zMin	)
  ( 	0	0	$zMin	)
  ( 	$Ddiv2	0	$zMin	)
  (	$xMax	0	$zMin	)
  (	$xMin	0 $Hdiv2 )
  ( 	$negDdiv2	0 $Hdiv2 )
  ( 	0	0 $Hdiv2 )
  ( 	$Ddiv2	0 $Hdiv2 )
  (	$xMax	0 $Hdiv2 )
  (	$xMin	0	$H	)
  ( 	$negDdiv2	0	$H	)
  ( 	0	0	$H	)
  ( 	$Ddiv2	0	$H	)
  (	$xMax	0	$H	)
  (	$xMin	0	$zMax	)
  ( 	$negDdiv2	0	$zMax	)
  ( 	0	0	$zMax	)
  ( 	$Ddiv2	0	$zMax	)
  (	$xMax	0	$zMax	)
  (	$xMin	$negBdiv2	$zMin	)
  ( 	$negDdiv2	$negBdiv2	$zMin	)
  ( 	0	$negBdiv2	$zMin	)
  ( 	$Ddiv2	$negBdiv2	$zMin	)
  (	$xMax	$negBdiv2	$zMin	)
  (	$xMin	$negBdiv2 $Hdiv2 )
  ( 	$negDdiv2	$negBdiv2 $Hdiv2 )
  ( 	0	$negBdiv2 $Hdiv2 )
  ( 	$Ddiv2	$negBdiv2 $Hdiv2 )
  (	$xMax	$negBdiv2 $Hdiv2 )
  (	$xMin	$negBdiv2	$H	)
  ( 	$negDdiv2	$negBdiv2	$H	)
  ( 	0	$negBdiv2	$H	)
  ( 	$Ddiv2	$negBdiv2	$H	)
  (	$xMax	$negBdiv2	$H	)
  (	$xMin	$negBdiv2	$zMax	)
  ( 	$negDdiv2	$negBdiv2	$zMax	)
  ( 	0	$negBdiv2	$zMax	)
  ( 	$Ddiv2	$negBdiv2	$zMax	)
  (	$xMax	$negBdiv2	$zMax	)
  (	$xMin	 $yMin	$zMin	)
  ( 	$negDdiv2	 $yMin	$zMin	)
  ( 	0	 $yMin	$zMin	)
  ( 	$Ddiv2	 $yMin	$zMin	)
  (	$xMax	 $yMin	$zMin	)
  (	$xMin	 $yMin $Hdiv2 )
  ( 	$negDdiv2	 $yMin $Hdiv2 )
  ( 	0	 $yMin $Hdiv2 )
  ( 	$Ddiv2	 $yMin $Hdiv2 )
  (	$xMax	 $yMin $Hdiv2 )
  (	$xMin	 $yMin	$H	)
  ( 	$negDdiv2	 $yMin	$H	)
  ( 	0	 $yMin	$H	)
  ( $Ddiv2	 $yMin	$H	)
  (	$xMax	 $yMin	$H	)
  (	$xMin	 $yMin	$zMax	)
  ( $negDdiv2	 $yMin	$zMax	)
  ( 0	 $yMin	$zMax	)
  ( $Ddiv2	  $yMin	$zMax	)
  (	$xMax	    $yMin	$zMax	)

);
 
blocks
(
  hex (0 1 6 5 20 21 26 25) ($nCell4 $nCell3 $nCell6) simpleGrading (0.2 5 0.2)
  hex (1 2 7 6 21 22 27 26) ($nCell1 $nCell3 $nCell6) simpleGrading (5 5 0.2)
  hex (2 3 8 7 22 23 28 27) ($nCell1 $nCell3 $nCell6) simpleGrading (0.4 5 0.2)
  hex (3 4 9 8 23 24 29 28) ($nCell5 $nCell3 $nCell6) simpleGrading (10 5 0.2)
  hex (5 6 11 10 25 26 31 30) ($nCell4 $nCell3 $nCell6) simpleGrading (0.2 0.4 0.2)
  hex (6 7 12 11 26 27 32 31) ($nCell1 $nCell3 $nCell6) simpleGrading (5 0.4 0.2)
  hex (7 8 13 12 27 28 33 32) ($nCell1 $nCell3 $nCell6) simpleGrading (0.4 0.4 0.2)
  hex (8 9 14 13 28 29 34 33) ($nCell5 $nCell3 $nCell6) simpleGrading (10 0.4 0.2)
  hex (10 11 16 15 30 31 36 35) ($nCell4 $nCell7 $nCell6) simpleGrading (0.2 40 0.2)
  hex (11 12 17 16 31 32 37 36) ($nCell1 $nCell7 $nCell6) simpleGrading (5 40 0.2)
  hex (12 13 18 17 32 33 38 37) ($nCell1 $nCell7 $nCell6) simpleGrading (0.4 40 0.2)
  hex (13 14 19 18 33 34 39 38) ($nCell5 $nCell7 $nCell6) simpleGrading (10 40 0.2)
  hex (20 21 26 25 40 41 46 45) ($nCell4 $nCell3 $nCell2) simpleGrading (0.2 5 5)
  hex (23 24 29 28 43 44 49 48) ($nCell5 $nCell3 $nCell2) simpleGrading (10 5 5)
  hex (25 26 31 30 45 46 51 50) ($nCell4 $nCell3 $nCell2) simpleGrading (0.2 0.4 5)
  hex (28 29 34 33 48 49 54 53) ($nCell5 $nCell3 $nCell2) simpleGrading (10 0.4 5)
  hex (30 31 36 35 50 51 56 55) ($nCell4 $nCell7 $nCell2) simpleGrading (0.2 40 5)
  hex (31 32 37 36 51 52 57 56) ($nCell1 $nCell7 $nCell2) simpleGrading (5 40 5)
  hex (32 33 38 37 52 53 58 57) ($nCell1 $nCell7 $nCell2) simpleGrading (0.4 40 5)
  hex (33 34 39 38 53 54 59 58) ($nCell5 $nCell7 $nCell2) simpleGrading (10 40 5)
  hex (40 41 46 45 60 61 66 65) ($nCell4 $nCell3 $nCell2) simpleGrading (0.2 5 0.4)
  hex (43 44 49 48 63 64 69 68) ($nCell5 $nCell3 $nCell2) simpleGrading (10 5 0.4)
  hex (45 46 51 50 65 66 71 70) ($nCell4 $nCell3 $nCell2) simpleGrading (0.2 0.4 0.4)
  hex (48 49 54 53 68 69 74 73) ($nCell5 $nCell3 $nCell2) simpleGrading (10 0.4 0.4)
  hex (50 51 56 55 70 71 76 75) ($nCell4 $nCell7 $nCell2) simpleGrading (0.2 40 0.4)
  hex (51 52 57 56 71 72 77 76) ($nCell1 $nCell7 $nCell2) simpleGrading (5 40 0.4)
  hex (52 53 58 57 72 73 78 77) ($nCell1 $nCell7 $nCell2) simpleGrading (0.4 40 0.4)
  hex (53 54 59 58 73 74 79 78) ($nCell5 $nCell7 $nCell2) simpleGrading (10 40 0.4)
  hex (60 61 66 65 80 81 86 85) ($nCell4 $nCell3 $nCell6) simpleGrading (0.2 5 40)
  hex (61 62 67 66 81 82 87 86) ($nCell1 $nCell3 $nCell6) simpleGrading (5 5 40)
  hex (62 63 68 67 82 83 88 87) ($nCell1 $nCell3 $nCell6) simpleGrading (0.4 5 40)
  hex (63 64 69 68 83 84 89 88) ($nCell5 $nCell3 $nCell6) simpleGrading (10 5 40)
  hex (65 66 71 70 85 86 91 90) ($nCell4 $nCell3 $nCell6) simpleGrading (0.2 0.4 40)
  hex (66 67 72 71 86 87 92 91) ($nCell1 $nCell3 $nCell6) simpleGrading (5 0.4 40)
  hex (67 68 73 72 87 88 93 92) ($nCell1 $nCell3 $nCell6) simpleGrading (0.4 0.4 40)
  hex (68 69 74 73 88 89 94 93) ($nCell5 $nCell3 $nCell6) simpleGrading (10 0.4 40)
  hex (70 71 76 75 90 91 96 95) ($nCell4 $nCell7 $nCell6) simpleGrading (0.2 40 40)
  hex (71 72 77 76 91 92 97 96) ($nCell1 $nCell7 $nCell6) simpleGrading (5 40 40)
  hex (72 73 78 77 92 93 98 97) ($nCell1 $nCell7 $nCell6) simpleGrading (0.4 40 40)
  hex (73 74 79 78 93 94 99 98) ($nCell5 $nCell7 $nCell6) simpleGrading (10 40 40)
);
 
edges
(
);
 
boundary
(
  ground
  {
       type wall;
       faces
       (
        (0 1 21 20)
        (1 2 22 21)
        (2 3 23 22)
        (3 4 24 23)
        (20 21 41 40)
        (23 24 44 43)
        (40 41 61 60)
        (43 44 64 63)
        (60 61 81 80)
        (61 62 82 81)
        (62 63 83 82)
        (63 64 84 83)
       );
   }

  sides_1
  {
       type patch;
       faces
       (
        (0 1 6 5)
        (1 2 7 6)
        (2 3 8 7)
        (3 4 9 8)
        (5 6 11 10)
        (6 7 12 11)
        (7 8 13 12)
        (8 9 14 13)
        (10 11 16 15)
        (11 12 17 16)
        (12 13 18 17)
        (13 14 19 18)
       );
   }
   sides_2
  {
       type patch;
       faces
       (
        (80 81 86 85)
        (81 82 87 86)
        (82 83 88 87)
        (83 84 89 88)
        (85 86 91 90)
        (86 87 92 91)
        (87 88 93 92)
        (88 89 94 93)
        (90 91 96 95)
        (91 92 97 96)
        (92 93 98 97)
        (93 94 99 98)
       );
   }

  inlet
  {
      type patch;
      faces
      (
        (0 20 25 5)
        (5 25 30 10)
        (10 30 35 15)
        (20 40 45 25)
        (25 45 50 30)
        (30 50 55 35)
        (40 60 65 45)
        (45 65 70 50)
        (50 70 75 55)
        (60 80 85 65)
        (65 85 90 70)
        (70 90 95 75)
    );
  }

  outlet
  {
      type patch;
      faces
      (
        (4 24 29 9)
        (9 29 34 14)
        (14 34 39 19)
        (24 44 49 29)
        (29 49 54 34)
        (34 54 59 39)
        (44 64 69 49)
        (49 69 74 54)
        (54 74 79 59)
        (64 84 89 69)
        (69 89 94 74)
        (74 94 99 79)
    );
  }

  top
  {
      type wall;
      faces
      (
        (15 16 36 35)
        (16 17 37 36)
        (17 18 38 37)
        (18 19 39 38)
        (35 36 56 55)
        (36 37 57 56)
        (37 38 58 57)
        (38 39 59 58)
        (55 56 76 75)
        (56 57 77 76)
        (57 58 78 77)
        (58 59 79 78)
        (75 76 96 95)
        (76 77 97 96)
        (77 78 98 97)
        (78 79 99 98)
    );
  }

  building
  {
      type wall;
      faces
      (
        (21 22 27 26)	
        (22 23 28 27)
        (26 27 32 31)
        (27 28 33 32)
        (61 62 67 66)	
        (62 63 68 67)
        (66 67 72 71)
        (67 68 73 72)	  
        (21 41 46 26)
        (41 61 66 46)
        (26 46 51 31)
        (46 66 71 51)
        (23 43 48 28)
        (43 63 68 48)
        (28 48 53 33)
        (48 68 73 53)
        (31 32 52 51)
        (32 33 53 52)
        (51 52 72 71)
        (52 53 73 72)
    );
  }
);
 
mergePatchPairs
(
);

// ************************************************************************* //
