examples/openfoam2206/singleBuilding/kOmegaSST_F1blend/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

probes
{
    libs            ("libsampling.so");
    type            probes;
    name            probes;
    writeControl    outputTime;//timeStep
    writeInterval   1;
    fields          (U k);
    interpolationScheme cellPoint;
    probeLocations
    (
        (-0.072    0    0.005)
        (-0.072    0    0.0205)
        (-0.072    0    0.0355)
        (-0.072    0    0.05)
        (-0.072    0    0.065)
        (-0.072    0    0.08)
        (-0.072    0    0.095)
        (-0.072    0    0.11)
        (-0.072    0    0.125)
        (-0.072    0    0.14)
        (-0.072    0    0.155)
        (-0.072    0    0.17)
        (-0.072    0    0.185)
        (-0.072    0    0.2)
        (-0.072    0    0.215)
        (-0.04    0    0.13)
        (-0.04    0    0.14)
        (-0.04    0    0.15)
        (-0.04    0    0.16)
        (-0.04    0    0.17)
        (-0.04    0    0.18)
        (-0.04    0    0.19)
        (-0.04    0    0.2)
        (-0.04    0    0.21)
        (-0.04    0    0.22)
        (0.0    0    0.13)
        (0.0    0    0.14)
        (0.0    0    0.15)
        (0.0    0    0.16)
        (0.0    0    0.17)
        (0.0    0    0.18)
        (0.0    0    0.19)
        (0.0    0    0.2)
        (0.0    0    0.21)
        (0.0    0    0.22)
        (0.04    0    0.13)
        (0.04    0    0.14)
        (0.04    0    0.15)
        (0.04    0    0.16)
        (0.04    0    0.17)
        (0.04    0    0.18)
        (0.04    0    0.19)
        (0.04    0    0.2)
        (0.04    0    0.21)
        (0.04    0    0.22)
        (0.105    0    0.005)
        (0.105    0    0.0205)
        (0.105    0    0.035)
        (0.105    0    0.05)
        (0.105    0    0.065)
        (0.105    0    0.08)
        (0.105    0    0.095)
        (0.105    0    0.11)
        (0.105    0    0.125)
        (0.105    0    0.14)
        (0.105    0    0.155)
        (0.105    0    0.17)
        (0.105    0    0.185)
        (0.105    0    0.2)
        (0.105    0    0.215)
        (0.105    0    0.23)
        (0.3    0    0.0055)
        (0.3    0    0.0255)
        (0.3    0    0.0455)
        (0.3    0    0.0655)
        (0.3    0    0.0855)
        (0.3    0    0.105)
        (0.3    0    0.125)
        (0.3    0    0.145)
        (0.3    0    0.165)
        (0.3    0    0.185)
        (0.3    0    0.205)
        (0.3    0    0.225)
    );
}

// ************************************************************************* //
